Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བདག་གིས་ཀྱང་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱ། ཀུན་འབྱུང་བ་རབ་ཏུ་སྤོང་བར་བྱ། འགོག་པ་མངོན་དུ་བྱ་ལམ་བསྒོམ་པར་བྱ། གཞན་ཡང་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱ་བ་དང་། ཀུན་འབྱུང་བ་རབ་ཏུ་སྤོང་བ་དང་།
en: They themselves should comprehend suffering; they should abandon the cause [of suffering]; they should actualize the cessation [of suffering]; they should cultivate the path [that leads to the cessation of suffering], and they should also encourage others to comprehend suffering, to abandon the cause [of suffering], to actualize the cessation [of suffering], and to cultivate the path.

source: འགོག་པ་མངོན་དུ་བྱ་བ་དང་། ལམ་བསྒོམ་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ། སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་རབ་ཏུ་སྤོང་བ་དང་། འགོག་པ་མངོན་དུ་བྱེད་པ་དང་།
en: They should praise the comprehension of suffering, the abandoning of the cause [of suffering], the actualizing of the cessation [of suffering], and the cultivation of the path.

source: ལམ་སྒོམ་པའི་ལེགས་པ་བརྗོད་པར་བྱ། སེམས་ཅན་གཞན་གང་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པར་བྱེད་པ་དང་། ཀུན་འབྱུང་བ་རབ་ཏུ་སྤོང་བ་དང་། འགོག་པ་མངོན་དུ་བྱེད་པ་དང་། ལམ་བསྒོམ་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings comprehending suffering, abandon the cause [of suffering], actualize the cessation [of suffering], and cultivate the path. “

source: །བདག་གིས་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར། ཤེས་པ་བསྐྱེད་དེ་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱ། གཞན་ཡང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བར་བྱ།
en: They themselves should develop understanding in order that knowledge of the fruit of entering the stream to nirvāṇa might be actualized, and they should also encourage others to acquire knowledge through which the fruit of entering the stream to nirvāṇa is actualized.

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the knowledge through which the fruit of entering the stream to nirvāṇa is actualized.

source: སེམས་ཅན་གཞན་གང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings actualizing knowledge of the fruit of entering the stream to nirvāṇa.

source: །བདག་གིས་ཀྱང་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་ཤེས་པ་བསྐྱེད་དེ། ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱ། གཞན་ཡང་དགྲ་བཅོམ་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should develop understanding in order that knowledge of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, and the fruit of arhatship might be actualized, but without actualizing the very limit of reality, and they should also encourage others to acquire knowledge through which the fruit of arhatship [and so forth] is actualized.

source: དགྲ་བཅོམ་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the knowledge through which the fruit of arhatship [and so forth] is actualized.

source: སེམས་ཅན་གཞན་གང་དགྲ་བཅོམ་པའི་འབྲས་བུ་ཤེས་པ་མངོན་དུ་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings actualizing knowledge of the fruit of arhatship [and so forth].

source: །བདག་གིས་ཀྱང་རང་བྱང་ཆུབ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་ཤེས་པ་བསྐྱེད་དེ། རང་བྱང་ཆུབ་ཤེས་པ་མངོན་དུ་བྱ་བས་ཡང་དག་པའི་མཐའ་མངོན་དུ་མི་བྱ། གཞན་ཡང་རང་བྱང་ཆུབ་ཤེས་པ་མངོན་དུ་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should develop understanding in order that knowledge of individual enlightenment might be actualized, but so that those who actualize knowledge of individual enlightenment do not actualize the very limit of reality, and they should also encourage others to acquire knowledge through which individual enlightenment is actualized.

source: རང་བྱང་ཆུབ་ཤེས་པ་མངོན་དུ་བྱ་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the knowledge through which individual enlightenment is actualized.

source: སེམས་ཅན་གཞན་གང་རང་བྱང་ཆུབ་ཤེས་པ་མངོན་དུ་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings actualizing knowledge of individual enlightenment. {Ki.

source: །བདག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་བྱ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 140} “They themselves should enter a bodhisattva’s full maturity, and they should also encourage others to enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise entry into the maturity of the bodhisattvas.

source: སེམས་ཅན་གཞན་གང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in other beings entering a bodhisattva’s full maturity.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འདོད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་བྱའོ།
en: It is in this way that bodhisattva great beings who wish to be emancipated in unsurpassed, complete enlightenment should dwell without apprehending anything. “

source: །བདག་གིས་ཀྱང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ། གཞན་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should bring beings to maturation, and they should also encourage others to bring beings to maturation.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the bringing of beings to maturation.

source: སེམས་ཅན་གཞན་གང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings bringing beings to maturation.

source: །བདག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བར་བྱ། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should refine the buddhafields, and they should also encourage others to refine the buddhafields.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the refinement of the buddhafields.

source: སེམས་ཅན་གཞན་གང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings refining the buddhafields.

source: བདག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བསྐྱེད་པར་བྱ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བསྐྱེད་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should develop the extrasensory powers of the bodhisattvas, and they should also encourage others to develop the extrasensory powers of the bodhisattvas.

source: མངོན་པར་ཤེས་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the extrasensory powers of the bodhisattvas.

source: སེམས་ཅན་གཞན་གང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་བསྐྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings developing the extrasensory powers of the bodhisattvas.

source: །བདག་གིས་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་བསྐྱེད་པར་བྱ། གཞན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should develop the wisdom of all-aspect omniscience, and they should also encourage others to acquire the wisdom of all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the wisdom of all-aspect omniscience.

source: སེམས་ཅན་གཞན་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་བསྐྱེད་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings developing the wisdom of all-aspect omniscience.

source: །བདག་གིས་ཀྱང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བར་བྱ། གཞན་ཡང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should abandon all afflicted mental states associated with reincarnation through the continuity of propensities, and they should also encourage others to abandon all afflicted mental states associated with reincarnation through the continuity of propensities.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the abandoning of all afflicted mental states associated with reincarnation through the continuity of propensities.

source: སེམས་ཅན་གཞན་གང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in other beings abandoning all afflicted mental states associated with reincarnation through the continuity of propensities.

source: །བདག་གིས་ཀྱང་ཚེ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་གཟུང་བར་བྱ། གཞན་ཡང་ཚེ་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: They themselves should acquire an excellent lifespan, and they should also encourage others to acquire an excellent lifespan.

source: ཚེ་ཕུན་སུམ་ཚོགས་པའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise an excellent lifespan.

source: སེམས་ཅན་གཞན་གང་ཚེ་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱའོ།
en: They should praise and take empathetic delight in other beings acquiring an excellent lifespan. {

source: །བདག་གིས་ཀྱང་དམ་པའི་ཆོས་གནས་པ་ཡོངས་སུ་གཟུང་བར་བྱ།
en: Ki.

source: གཞན་ཡང་དམ་པའི་ཆོས་གནས་པ་ཡོངས་སུ་གཟུང་བ་ལ་ཡང་དག་པར་བསྐུལ་བར་བྱ།
en: IV: 141} They themselves should acquire the stability of the Dharma, and they should also encourage others to acquire the stability of the Dharma.

source: དམ་པའི་ཆོས་གནས་པ་ཡོངས་སུ་གཟུང་བའི་ལེགས་པ་བརྗོད་པར་བྱ།
en: They should praise the stability of the Dharma.

source: སེམས་ཅན་གཞན་གང་དམ་པའི་ཆོས་གནས་པ་ཡོངས་སུ་འཛིན་པ་དེ་དག་གི་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱ་སྟེ།
en: They should praise and take empathetic delight in other beings acquiring the stability of the Dharma.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་བར་འདོད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གནས་པར་བྱའོ།
en: Subhūti, it is in this way that bodhisattva great beings who wish to be emancipated in unsurpassed, complete enlightenment should dwell without apprehending anything. “

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་ལ་བསླབ་པར་བྱའོ། །དེ་དེ་ལྟར་སློབ་ཅིང་དེ་དེ་ལྟར་གནས་པས།
en: Bodhisattva great beings should train accordingly in the perfection of wisdom and in skill in means.

source: དེའི་གཟུགས་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: The physical forms of those who do so will be unobscured.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Their feelings, perceptions, formative predispositions, and consciousness will be unobscured.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Their sense fields, sensory elements, and links of dependent origination will be unobscured.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: All the perfections, all their aspects of emptiness, and the thirty-seven factors conducive to enlightenment will be unobscured. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: All the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, will be unobscured.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཤེས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Knowledge of the fruit of entering the stream to nirvāṇa will be unobscured.

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཤེས་པ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཤེས་པ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཤེས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Knowledge of the fruit of being destined for only one more rebirth, knowledge of the fruit of no longer being subject to rebirth, and knowledge of arhatship will be unobscured.

source: །རང་བྱང་ཆུབ་ཤེས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Knowledge of individual enlightenment will be unobscured.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: Entry into the maturity of the bodhisattvas will be unobscured.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: The acts that bring maturity to beings and refine the buddhafields will be unobscured.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: The wisdom of all-aspect omniscience will be unobscured.

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: The abandoning of all afflicted mental states associated with reincarnation through the continuity of propensities will be unobscured.

source: །ཚེ་ཕུན་སུམ་ཚོགས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ། །དམ་པའི་ཆོས་གནས་པ་སྒྲིབ་པ་མེད་པར་འགྱུར་རོ།
en: An excellent lifespan will be unobscured, and the stability of the Dharma will be unobscured. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སྔོན་གྱི་མཐའ་ནས་ཀྱང་གཟུགས་ཡོངས་སུ་མ་བཟུང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་བཟུང་།
en: If you ask why, Subhūti, it is because those bodhisattva great beings of the past have not grasped physical forms, and they have not grasped feelings, perceptions, formative predispositions, or consciousness.

source: སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡོངས་སུ་མ་བཟུང་ངོ་།
en: They have not grasped the sense fields, sensory elements, or links of dependent origination.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་མ་བཟུང་ངོ་།
en: They have not grasped any of the perfections, any of the aspects of emptiness, or the thirty-seven factors conducive to enlightenment.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ཡོངས་སུ་མ་བཟུང་ངོ་།
en: They have not grasped [any of the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་མ་བཟུང་ངོ་།
en: They have not grasped [any of the goals], up to and including all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་གཟུགས་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན།
en: If you ask why, it is because those physical forms that have not been grasped are not physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན།
en: Those feelings, perceptions, formative predispositions, and consciousness that have not been grasped are not consciousness [and so forth].

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན།
en: Those sense fields, sensory elements, and links of dependent origination that have not been grasped are not the links of dependent origination [and so forth].

source: ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མ་ཡིན།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment that have not been grasped are not the factors conducive to enlightenment [and so forth]. [

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མ་ཡིན།
en: All the causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, that have not been grasped are not the qualities of the buddhas [and so forth]. [

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་གཟུང་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ།
en: All the goals], up to and including all-aspect omniscience, that have not been grasped are not all-aspect omniscience [and so forth].”

source: །བྱང་ཆུབ་སེམས་དཔའི་གནས་འདི་བཤད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཉིས་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: When he explained this abiding nature of the bodhisattvas, two thousand bodhisattvas acquired acceptance that phenomena are nonarising.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་སུམ་ཅུ་བརྒྱད་པའོ།། །།དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: This completes the thirty-eighth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Chapter 39 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, what are the attributes of bodhisattva great beings who are irreversible?

source: །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པ་ནི་གང་ལགས་ཚུལ་ནི་གང་ལགས་ཇི་ལྟར་བདག་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་ཕྱིར་མི་ལྡོག་པའོ་ཞེས་བགྱི་བར་འཚལ་བར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: What are their indications? What are their signs? How should we know that such bodhisattva great beings are irreversible?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་སོ་སོའི་སྐྱེ་བོའི་ས་དང་། ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དང་།
en: The Blessed One replied to the venerable Subhūti, “In this regard, Subhūti, the level of ordinary people, the level of the śrāvakas, the level of the pratyekabuddhas, the level of the bodhisattvas, and the level of the tathāgatas—all these levels [of spiritual attainment] that have been explained—are unchanging in the real nature.

source: དེ་བཞིན་གཤེགས་པའི་སར་བཤད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: They are nonconceptual, nondual, and indivisible.

source: དེ་བཞིན་ཉིད་ལ་འགྱུར་བ་མེད་ཅིང་།
en: Those [bodhisattva great beings] engage definitively in that real nature, just as it is.

source: རྣམ་པར་རྟོག་པ་མེད་ལ་གཉིས་སུ་མེད་ཅིང་གཉིས་སུ་བྱར་མེད་དོ།
en: They do not conceive of that real nature, and so they engage without conceiving of it.

source: །དེ་ནི་དེ་བཞིན་ཉིད་དེ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་འཇུག་སྟེ། དེ་བཞིན་ཉིད་ལ་རྣམ་པར་མི་རྟོག་ཅིང་དེ་ལྟར་རྣམ་པར་མི་རྟོག་པས་འཇུག་སྟེ་དེ་ལྟར་ཞུགས་པ་ནི་དེ་བཞིན་ཉིད་དེ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཐོས་ནས། དེ་ལས་འདས་ཏེ་དེ་དག་དེ་བཞིན་ཉིད་ལ་རེ་རེ་དང་། གཉིས་ཀ་དང་། གཉིས་ཀ་མ་ཡིན་པར་ཐེ་ཚོམ་ཟ་བ་གང་ཡང་མེད་དོ།
en: Having engaged in that manner, and having definitively heard about the real nature, just as it is, they transcend such [levels of attainment] and they are not in the slightest consumed by doubt, thinking that the real nature is individual, dual, or neither.

source: །དེ་ནི་བྱུང་རྒྱལ་དུ་སྨྲ་བ་མ་ཡིན་ཏེ།
en: They do not prattle incoherently.

source: དོན་དང་ལྡན་པར་སྨྲའི། དོན་དང་མི་ལྡན་པར་སྨྲ་བ་མ་ཡིན།
en: They speak words that are meaningful, without speaking meaninglessly.

source: གཞན་གྱིས་བྱས་པ་དང་མ་བྱས་པ་ལ་མི་ལྟ་ཞིང་།
en: They do not look upon what others have and have not done.

source: ལེགས་པར་བརྗོད་པ་ཚོལ་བ་ཡིན་ཏེ།
en: They pursue excellent speech. {Ki.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་། ཚུལ་དེ་དག་དང་མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ།
en: IV: 142} Subhūti, one should know that bodhisattva great beings who possess those attributes, those indications, and those signs are irreversible.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་པ་གང་དང་ཚུལ་གང་དང་མཚན་མ་གང་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, through which attributes, indications, and signs are bodhisattva great beings known to be irreversible?” “

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པ་མེད་པ། ཚུལ་མེད་པ། མཚན་མ་མེད་པའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རྣམ་པ་མ་མཆིས་པ།
en: Subhūti, all phenomena are without attributes, without indications, and without signs!”

source: ཚུལ་མ་མཆིས་པ།
en: replied the Blessed One. “

source: མཚན་མ་མ་མཆིས་པ། མཚན་མ་མ་མཆིས་པ་ལགས་ན། ཆོས་གང་རྣམས་ལས་སླར་ལྡོག་པའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པ་ཞེས་བསྟན་པ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, if all phenomena are without attributes, without indications, and without signs, then from what phenomena have the bodhisattva great beings turned away so that they may be revealed to be irreversible?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གཟུགས་ལས་ཕྱིར་ལོག་པ། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལས་ཕྱིར་ལོག་པ། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལས་ཕྱིར་ལོག་པ་དེ་ནི། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཕྱིར་ལོག་པ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་ར
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings have turned away from physical forms, when they have turned away from feelings, perceptions, formative predispositions, and consciousness, and when they have turned away from the sense fields, the sensory elements, and the links of dependent origination, then, Subhūti, you should know that those bodhisattva great beings are irreversible.

source: བ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་ཕྱིར་ལོག་པ། ནང་སྟོང་པ་ཉིད་ལས་ཕྱིར་ལོག་པ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལས་ཕྱིར་ལོག་པ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལས་ཕྱིར་ལོག་པ། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་། སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལས་ཕྱིར་ལོག་པ། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལས་ཕྱིར་ལོག་པ་རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ལས་ཕྱིར་ལོག་པ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལས་ཕྱིར་ལོག་པ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཕྱིར་ལོག་པ། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལས་ཕྱིར་ལོག་པ།
en: When bodhisattva great beings have turned away from the perfection of generosity; when they have turned away from the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom; when they have turned away from the emptiness of internal phenomena; when they have turned away from [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; when they have turned away from the applications of mindfulness; when they have turned away from the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; when they have turned away from the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; when they have turned away from the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; when they have turned away from the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas; when they have turned away from the levels of the śrāvakas and the pratyekabuddhas; when they have turned away from knowledge of the path; and when they have turned away from unsurpassed, complete enlightenment, then, Subhūti, you should know that those bodhisattva great beings are irreversible. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལོག་པ་དེ་ནི། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གནས་པར་འགྱུར་བའི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, Subhūti, it is because there is no essential nature of physical forms in which bodhisattva great beings could be established.
